--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
 ▄▀             help1  : مساعدة             ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "مساعدة" then
return [[🔰💠 - اوامر الرفع في الكروب💠♨️
➖🔸➖🔹➖🔸➖🔹➖ـ
♨️-رفع اداري: لرفع اداري
♨️-تنزيل اداري : لحذف الاداري 
♨️-رفع المدير : اضافة #مدير
♨️-رفع ادمن : لاضافة  ادمن
♨️-تنزيل ادمن : تنزيل ادمن
♨️-الادمنيه : اضهار الادمنيه
♨️-مدير المجموعه : اضهار المدير
🔰✔️اوامر الطرد في الكروب
💢-بلوك : لطرد المستخدم
💢-حظر :  لحضر المستخدم
💢-الغاء الحظر : لفك حضر المستخدم
💢-مغادره : للخروج من لمجموعه
🔕-كتم  : لكتم المستخدم
🔔-كتم  : لالغاء كتم المستخدم
🔈-المكتومين  :عرض المكتومين
⛔️-منع : لحضر الكلمات في المجموعه
🔓-الغاء المنع  : لفتح حضر الكلمه
📖-قائمه المنع  : لعرض الكلمات المحضوره
⚠️-حظر عام : باند عام
⚠️🔓-الغاء العام : لالغاء العام
📖-قائمه العام  : لعرض المحضورين عام
🔰✔️ - اوامر الكروب الاعتيادية
🆔-ايدي : لعرض ايدي المجموعه
🆔-ايدي : لضهار ايدي الشخص بلرد
✅-معلوماتي :اضهار المعلومات الخاصه بك
🔰✅-معلومات المجموعه : لاضهار معلومات المجموعه
❌-القوانين : لاضهار القوانين
⛔️-مسح : لمسح اي  كلمه بل رد
❗️-ضع قوانين : اضافه قوانين
💱-ضع وصف : اضافة حول 
🌌-وضع صوره : لاضافة صورة
❗️-الرابط خاص : لجلب الرابط خاص
🔱-الرابط : لعرض الرابط
✅-تفعيل : لتفعيل المجموعة
⛔️-تعطيل : الغاء تفعيل المجموعة
🤗-صوره: لتحويل الملصق الى صورة
🤔-شنو اني :لمعرفه موقعك في المجموعه
⚠️-الاعدادات : اضهار الاعدادات المجموعه
🔓✔️🔐 - اوامر الحماية
-فتح🔓قفل 🔒 الاضافه
✔️-فتح🔓قفل 🔒البوتات
✔️-فتح🔓قفل🔒 المجموعه
✔️-فتح🔓قفل🔒 الدردشه
✔️-فتح🔓قفل🔒 الصور 
✔️-فتح🔓قفل🔒 الصوت
✔️-فتح🔓قفل🔒 الفيديو
✔️-فتح🔓قفل🔒الروابط
✔️-فتح🔓قفل🔒 التكرار 
✔️-فتح🔓قفل🔒 الملصقات
✔️-فتح🔓قفل🔒الصور المتحركه 
✔️-فتح🔓قفل🔒 الفايلات 
✔️-فتح🔓قفل🔒 الكلايش 
✔️-فتح🔓قفل🔒 الاضافه الجماعيه 
✔️-فتح🔓قفل🔒 العربيه   
✔️-فتح🔓قفل🔒 اعاده توجيه
📛-مسح رسائل المجموعه :لحذف جميع رسائل الكروب
📛-مسح رسائل العضو: مسح جميع رسائل العضو بالرد
️🔰-مسح الادمنية : لحذف الادمنية
 :للتواصل مع المطور
__________________
🍃❤️ - Dev - @O_q1j
🍃❤️ - Dev @SHAKE_A17
]]
end

if not is_momod(msg) then
return "للمشرفين فقط 😎🖕🏿"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"/(مساعدة)"
},
run = run 
}
end
