-- made by { @Mouamle }
do
ws = {}
rs = {}

-- some examples of how to use this :3
ws[1] = "هلاو" 
rs[1] = "هلاوو99وووات نورت/ي ❤️🙈" 

ws[2] = "هلو" -- msg
rs[2] = "هلاوات 🙈❤️" -- reply

ws[3] = "شلونكم" -- msg
rs[3] = "الحمدلله وانته 🌚🍃" -- reply

ws[4] = "دووم" -- msg 
rs[4] = "يدوم نبضك ❤️🍃" -- reply

ws[5] = "شونك"
rs[5] = "الحمدلله وانته"

ws[6] = "شلونك"
rs[6] = "الحمدلله وانته"

ws[7] = "غنيلي"
rs[7] = " قنيتلك قنية وعش ماجيت يلقالي 🌝😹"

ws[8] = "شغل المبردة"
rs[8] = " تم تشغيل المبردة بنجاح ❄️"

ws[9] = "طفي المبردة"
rs[9] = "طفيتهه 😒🍃"

ws[10] = "شغل السبلت"
rs[10] = "شغلته 🌚🍃 بس حثلجون معليه ترا "

ws[11] = "مايا خليفه"
rs[11] = " 😂 عيب صايمين"

ws[12] = "فطور"
rs[12] = "واخيراً 😍😍 خل اروح افطر "

ws[13] = "الزمة الية"
rs[13] = "لزمتة ح تنيجو انت و @O_q1j "

ws[14] = "شيخ"
rs[14] = " ها حياتي😻❤️ "

ws[15] = "تخليني"
rs[15] = "🌞🔺عيب منا العالم تعال وره 12 نايمين واشتغلك 🌝✋🏿"

ws[16] = "زاحف"
rs[16] = "زاحف على خالتك 🌝🍃"

ws[17] = "تركيا"
rs[17] = "😐🍃 فديتهه"

ws[18] = "عدنان"
rs[18] = "هذا الي صنعني فديت ربه 🙈❤️"

ws[19] = "الدولة الاسلامية"
rs[19] = "انته داعشي ؟؟ 😒💔"

ws[20] = "سني"
rs[20] = "لتصير طائفي 😒🖐"

ws[21] = "شيعي"
rs[21] = "لتصير طائفي 😕"

ws[22] = "تبادل"
rs[22] = "عزيزي هےـِذٌٱ مو قروب تبادل 😕✋🏿 "

ws[23] = "العراقيين"
rs[23] = "احلى ناس ولله 😍🙈"

ws[24] = "من وين"
rs[24] = "شعليك زاحف 😂🔥 "

ws[25] = "هاي"
rs[25] = "هاي حليـــــــب وويا هيل همينه وشكر زايد😹💔"

ws[26] = "البوت"
rs[26] = "معاجبك ؟ 😕😒🍃"

ws[27] = "البوت واكف"
rs[27] = "لتجذب 😒"

ws[28] = "منو ديحذف رسائلي"
rs[28] = "محد 😐🍃"

ws[29] = "كلاش اوف كلانس"
rs[29] = "تلعبهه ؟ شكد لفلك ؟"

ws[30] = "جوني"
rs[30] = "😂 مأذيك ؟"

ws[31] = "ازحف "
rs[31] = " على اختك ازحف 🌚🍃 "

ws[32] = "محمد"
rs[32] = " شتريد منه ؟ "

ws[33] = "منتظر"
rs[33] = " شتريد منه ؟ "

ws[34] = "سجاد"
rs[34] = " عبر الباب😹 "

ws[35] = "كرار"
rs[35] = "شتريد منه ؟"

ws[37] = "سايكو"
rs[37] = " شتريد منه ؟ "

ws[38] = "ابراهيم"
rs[38] = " شتريد منه ؟ "

ws[39] = "المنصور"
rs[39] = " احلى ناس ولله "

ws[40] = "المدرسه"
rs[40] = " 😒🍃 الله لا يراوينه "

ws[41] = "تحبني"
rs[41] = " 💋اعشقك آإمـ﴿💋﴾ـحہ͡✟ 🙊"

ws[42] = "يعني شكد"
rs[42] = " فوك متتوقع "

ws[43] = "😂"
rs[43] = " دوم حبي ❤️"

ws[44] = "هههه"
rs[44] = " دوم حبي ❤️"

ws[45] = "ههههه"
rs[45] = " دوم حبي ❤️"

ws[46] = "😹"
rs[46] = " دوم حبي ❤️"

ws[47] = "🌚"
rs[47] = " منور صخام الجدر 🌚🍃"

ws[48] = "😍"
rs[48] = " مح فديتك"

ws[49] = "مح"
rs[49] = "😻خدرت خرب ماتحمل بعد يلا امشي خاص😻"

ws[50] = "@O_q1j"
rs[50] = "هذا الي صنعني فديت ربه 🙈❤️"

ws[51] = "منحرف"
rs[51] = " وينه حطرده 🌚🌚"

ws[52] = "😭"
rs[52] = " 😢😢 لتبجي"

ws[53] = "😢"
rs[53] = " لتبجي 😭😭"

ws[54] = "شكد عمرك"
rs[54] = "زاحفه 😂😂"

ws[55] = "شكد عمرج"
rs[55] = " زاحف 😂"

ws[56] = "اقرالي دعاء"
rs[56] = " اللهم عذب المدرسين 😢 منهم الاحياء والاموات 😭🔥 اللهم عذب ام الانكليزي 😭💔 وكهربها بلتيار الرئيسي 😇 اللهم عذب ام الرياضيات وحولها الى غساله بطانيات 🙊 اللهم عذب ام الاسلاميه واجعلها بائعة الشاميه 😭🍃 اللهم عذب ام العربي وحولها الى بائعه البلبي اللهم عذب ام الجغرافيه واجعلها كلدجاجه الحافية اللهم عذب ام التاريخ وزحلقها بقشره من البطيخ وارسلها الى المريخ اللهم عذب ام الاحياء واجعلها كل مومياء اللهم عذب المعاون اقتله بلمدرسه بهاون 😂😂😂"

ws[57] = "غبي"
rs[57] = " انته الاغبى"

ws[58] = "دي"
rs[58] = "امشي ابوك بيها 🌝✋🏿"

ws[59] = "منو حبيبك"
rs[59] = " اختك 🙈"

ws[60] = "تكرهني"
rs[60] = " يي 😈"

ws[61] = "اكرهك"
rs[61] = " اختك تحبني 😻😹✋🏿🍃"

ws[62] = "😂"
rs[62] = " دوم حبي ❤️"

ws[63] = "الاعضميه"
rs[63] = " احسن ناس وربي❤️"

ws[64] = "الكرادة"
rs[64] = " احسن ناس وربي❤️"

ws[65] = "شارع فلسطين"
rs[65] = " احسن ناس وربي❤️"

ws[66] = "ببكن ملف"
rs[66] = " دي تحلم 😒😒"

ws[67] = "😇"
rs[67] = " اته مو ملاك اته جهنم بنفسهه 😂"

ws[68] = "😐"
rs[68] = " شبيك صافن 😒🔥"

ws[69] = "انجب"
rs[69] = "😭😡انجبو انتو فوك محامي كروبكم 😡😭"

ws[70] = "حارة"
rs[70] = "يي كولش 😭🍃🔥"

ws[71] = "خالتك"
rs[71] = " راح اطردك لك 😒"

ws[72] = "اطرد البوت"
rs[72] = " راح ابقة احترمك❤️"

ws[73] = "هه"
rs[73] = " شدتحس"

ws[74] = "شدتحس"
rs[74] = " دا ادحسه بيك/ج"

ws[75] = "اكولك"
rs[75] = " كول بعد عمري ❤️🍃"

ws[76] = "اكلك"
rs[76] = " قول ماقول لحد 😹✋🏿🍃"

ws[78] = "بغداد"
rs[78] = " 😍 فديتهه"

ws[79] = "البصرة"
rs[79] = " احسن ناس وربي❤️"

ws[80] = "تركماني"
rs[80] = " والنعم منك❤️"

ws[81] = "منو ابوك"
rs[81] = "😇😍👈هذآ بابه @O_q1j 👉😍😇"

ws[83] = "باي"
rs[83] = " بايات ❤️🍃"

ws[84] = "تنح"
rs[84] = "عيب ابني 😒🍃"

ws[85] = "جوعان"
rs[85] = "تعال اكلني 😐😂"

ws[86] = "عطشان"
rs[86] = "روح اشرب مي"

ws[87] = "صايم"
rs[87] = "شسويلك 😐🍃"

ws[88] = "☹️"
rs[88] = "لضوج حبيبي 😢❤️🍃"

ws[89] = "😔"
rs[89] = " ليش الحلو ضايج ❤️🍃"

ws[90] = "فرخ"
rs[90] = "☹️ترى اذا اطلعه بطولك واليكرم ابو اكرم☹️"

ws[92] = "كسمك"
rs[92] = " تاك لوالدتك 🌝✋🏿"

ws[93] = "نعال"
rs[93] = " بوجهك 😐😂"

ws[94] = "حروح اسبح"
rs[94] = " واخيراً 😂"

ws[95] = "حروح اغسل"
rs[95] = " واخيراً 😂"

ws[96] = "حروح اطب للحمام"
rs[96] = " واخيراً 😂"

ws[97] = "حبيبتي"
rs[97] = " بخت كلها كبلت ✿بُْـﮩ❁ﮩـس↜ ٲني بقيت 💔🚶"

ws[98] = "كبلت"
rs[98] = " بخت كلها كبلت ✿بُْـﮩ❁ﮩـس↜ ٲني بقيت 💔🚶"

ws[99] = "البوت عاوي"
rs[99] = " مثل امڪ 🌝🍃"

ws[100] = "منور"
rs[100] = " بنورك حبي 😍🍷"

ws[101] = "حفلش"
rs[101] = " افلش راسك"

ws[102] = "كردي"
rs[102] = "والنعم منك ❤️"

ws[103] = "طفي السبلت"
rs[103] = " تم اطفاء السبلت بنجاح 🌚🍃"

ws[104] = "🌝"
rs[104] = "هه"

ws[105] = "اذن المغرب"
rs[105] = "استحرم 🌚🍃"

ws[106] = "حلو"
rs[106] = "انت الاحلى 🌚❤️"

ws[107] = "احبك"
rs[107] = " اني اكثر 😍🍃"

ws[108] = "😑"
rs[108] = " شبيك 🍃☹"

ws[109] = "😒"
rs[109] = "😐 شبيك كالب وجهك "

ws[110] = "منو تحب"
rs[110] = "خالتك الشكرة"

ws[111] = "اباجر العيد"
rs[111] = "كل عام وانت بالف خير حبي 😇❤️"

ws[112] = "فديت"
rs[112] = "ها  زاحف كمشتك"

ws[113] = "مضغوط"
rs[113] = "دي انضغظ منك ؟ 😂😂"

ws[114] = "فديت"
rs[114] = "ها  زاحف كمشتك"

ws[115] = "فديتك"
rs[115] = "ها  زاحف كمشتك"

ws[116] = "فديتج"
rs[116] = "ها  زاحف كمشتك"

ws[117] = "شوف خاصك"
rs[117] = "شدازله 😱😨"

ws[118] = "تعال خاص"
rs[118] = "شحسوون 😱"

ws[119] = "تعالي خاص"
rs[119] = "شحسوون 😱"

ws[120] = "دخل السبام"
rs[120] = "شحسوون 😱"

ws[121] = "😎"
rs[121] = "يلا عود انته فد نعال 😐🍃"

ws[122] = "😱"
rs[122] = "خير خوفتني 😨"

ws[123] = "كحبه"
rs[123] = "اختڪ"

ws[124] = "بيش ساعة"
rs[124] = "ما اعرف 🌚🍃"

ws[125] = "🚶🏻"
rs[125] = "خير 🌝"

ws[126] = "منو اكثر واحد تحبه"
rs[126] = "خالتك"

ws[127] = "ليش"
rs[127] = "تاكل خرة الجيش 😂😂"

ws[128] = "طاسه"
rs[128] = "امك حلوة ورقاصه 💃🏻"

ws[129] = "عشرين"
rs[129] = "تاكل جدر خنين 😫"

ws[130] = "ميه"
rs[130] = "😂تشرب مميه"

ws[131] = "اربعة"
rs[131] = "😂لحيه ابوك مربعه"

ws[132] = "فارة"
rs[132] = "😂دفترك كله صفارة"

ws[133] = "ميتين"
rs[133] = "😂فوك راسك قندرتين"

ws[134] = "مات"
rs[134] = "ابو الحمامات 🐦"

ws[135] = "توفه"
rs[135] = "ابو اللفه 🌯"

ws[136] = "احترك"
rs[136] = "🍾البو العرك"

ws[137] = "غرك"
rs[137] = "ابو العرك 🍾"

ws[138] = "طار"
rs[138] = "ابن الطيار"

ws[139] = "ديسحك"
rs[139] = "😂😂 هاي بعده"

ws[140] = "لتسحك"
rs[140] = "😐😂 وك"

ws[141] = "اندرويد"
rs[141] = "افشل نظام بلعالم 🌝🍷"

ws[142] = "ios"
rs[142] = "احسن نظام بلعالم🌚❤️"

ws[143] = "ايفون"
rs[143] = "فديتك اته والايفون 🌚🔥"

ws[144] = "كلكسي"
rs[144] = "فاشل اخرة نوع تلفون🔥☹"

ws[145] = "سامسونك"
rs[145] = "فاشل اخرة نوع تلفون🔥☹"

ws[146] = "لتزحف"
rs[146] = "وك اسف 🙁😔"

ws[147] = "حاته"
rs[147] = "زاحف 😂 منو هاي دزلي صورتهه"

ws[148] = "حات"
rs[148] = "زاحفه 😂 منو هذا دزيلي صورته"

ws[149] = "صاكه"
rs[149] = "زاحف 😂 منو هاي دزلي صورتهه"

ws[150] = "صاك"
rs[150] = "زاحفه 😂 منو هذا دزيلي صورهه"

ws[151] = "منو اني"
rs[151] = "انته احلى شي بحياتي ❤️🍃"

ws[152] = "ابن الكلب"
rs[152] = "لاتغلط على ابوي 🙁😿 انته ابن الكلب 🌝✋🏿"

ws[153] = "انجب انته"
rs[153] = "وك وك 😭😔"

ws[154] = "حطردك"
rs[154] = "اعصابك 😨 لتتهور"

ws[155] = "المطور"
rs[155] = "شتريد من المطور O_q1j@ 😐🍃"

ws[156] = "منو اكثر واحد تكرهه"
rs[156] = "انته"

ws[157] = "شباب"
rs[157] = "نعم حبي 🌝❤️"

ws[158] = "اته زلمه"
rs[158] = "تعال لزمه 😐😂"

ws[159] = "الاحد"
rs[159] = "هذا اليوم نحس بلنسبه الي"

ws[160] = "الاثنين"
rs[160] = "يوم اجة بي ناس عزيزين وفقدت بي ناس هم ☹"

ws[161] = "هلاوو"
rs[161] = "هلاوات ❤️🍃"

ws[162] = "اتفل"
rs[162] = "خـۣۛـۣۛ﴿تۣۛـۣۛـفـۣۛـۣۛـہٰ୭ۭۢ💦﴾ـخـۣۛخــہۢۛ'ۦ✿⇣"

ws[163] = "كواد"
rs[163] = "هيه الكواده حلوه بس سمعتها خره 🙁😹✋🏿"

ws[164] = "😌"
rs[164] = "المطلوب ؟"

ws[165] = "هلا"
rs[165] = " 🌚🍃هلاوات"

ws[166] = "مرحبا"
rs[166] = "مرحبتين 😍🍃"

ws[167] = "سلام"
rs[167] = "السلام عليكم 🌝🍃"

ws[168] = "السلام"
rs[168] = "السلام عليكم 🌝🍃"

ws[169] = "السلام عليكم"
rs[169] = "عليكم السلام 🌝🍃"

ws[170] = "تسلم"
rs[170] = "الله يسلمك 😍"

ws[171] = "منو امك"
rs[171] = "🙁😭ماعندي ام يتيم والله عااا😭🙁"

ws[172] = "@U_T_U"
rs[172] = "هےـِذٌٱ الاثول صديق ابويه بس احبه 😻😹🍃"

ws[173] = "كس"
rs[173] = "امك"

ws[174] = "الحب"
rs[174] = "الحب!  ليس عندما تلعب بشعر حبيبتك!  الحب هو عندما تلعب بشعرتها 😹✋🏿"

ws[175] = "اخوي"
rs[175] = "دود وخنافس سود كون بخصوتك ياعفن ياجايف ياعر اخوتك 😹✋🏿"

ws[176] = "ضوجه"
rs[176] = "☹️اي ضوجه وماكو تكبيل وكذا تجي نطلع☹️"

ws[177] = "يله"
rs[177] = "😹اوكف خلي البس الحذاء  😹"

ws[178] = "شنو رئيك بهذا"
rs[178] = "😻صاك فديته لو اندل بيته 😻🙊"

ws[179] = "شنو رئيك بهايه"
rs[179] = "❤️🙈يومه فديت آلحاته ببكن حلق 😻😹"

ws[180] = "🚶💔"
rs[180] = "لماذا مقسور 🙁✋🏿🍃"

ws[181] = "غنيلي راب"
rs[181] = "والمضروب بوري تلكا بالسعدون يسكُر بشارع وتـتـ بجي كُبدهأإ كٌبل اسبوع دكٌلها طأبع مأإ قطـت صأإحبهأإ تبجيُ وأإلمصرف عليهأإ قأإطع  أو هيـه اجرت نيجتهأإ من ينزل الأيفون ألـساأإبع وأإني ألمحدق تلكٌوني عفت أإلفيس ورحـت الجأإمع  مو مأإل انقط بهدأإيه جيبيٌ طأإ طأإ طيزه طأإلع يأإوسفه خلـونيٌ للجأإمع أإهرب مو حـته صأإبون ماعـنديٌ يعنيٌ رأس مأإكُدر أضربُ أصلأأ هلٌ ليله تلكٌوني أإدشربٌ ويهٌ أإلعفطيهُ وصأإحبتي دومأإها زعلأنه صأإحبتيُ جنهأإ خفأش شـو ألي رأح يطكُ هذيُ اللـيلهُ أليُ عندهُ صيـدليـه  رأإح يصيـر وأإحـد زنـكيلٌ هلٌـكد مــأحيبـع فـلأش يـأإ عموُ يأإبو الهـدأيه صـدكني الكـحبه متـوب  جيـب أيفـون أحسلكٌ واللهٌ بعـد مأإيفيدٌ الدبـدوبً ألزينهٌ الـي مأإتنأإج مـن ألزب تسـوي سوٌب ولـت أيأم الـخلاق كأإمنُ يـدورنُ زبزو هأإبي فالنتاين بجز  😹😹😹😹 #Dev: @O_q1j"

ws[182] = "كلخره"
rs[182] = "اعذرني ما اكلك 🌝✋🏿"

ws[183] = "كلخرا"
rs[183] = "اعذرني ما اكلك 🌝✋🏿"

ws[184] = "كلخراا"
rs[184] = "اعذرني ما اكلك 🌝✋🏿"

ws[185] = "وينكم" 
rs[185] = "نايمين بلخاص 😹👉"

ws[186] = "الوو"
rs[186] = "ما اسمعك الشبكة ضعيفة 😕🍃"

ws[187] = "الووو"
rs[187] = "ما اسمعك الشبكة ضعيفه"

ws[189] = "حيدر"
rs[189] = "هےـِذٌٱ الاثول صديق ابويه بس احبه 😻😹🍃"

ws[190] = "يلةة"
rs[190] = "😹اوكف خلي افتح السحاب😹"

ws[191] = "كس اختك"
rs[191] = "وختك ويايه ع الواهس اختي تضوج وحدهة"

ws[192] = "كسختك"
rs[192] = "وختك ويايه ع الواهس اختي تضوج وحدهة"

ws[193] = "تف"
rs[193] = "عليك 🌝✋🏿"

ws[194] = "اتفل ع عمك"
rs[194] = "خـۣۛـۣۛ﴿تۣۛـۣۛـفـۣۛـۣۛـہٰ୭ۭۢ💦﴾ـخـۣۛخــہۢۛ'ۦ✿⇣"

ws[195] = "بوس عمتك"
rs[195] = "آإمـ﴿💋﴾ـحہ͡✟ 🙊"

ws[196] = "جب"
rs[196] = "اجب عليك 😹✋🏿"

ws[197] = "☺️"
rs[197] = "صدقه للخشول ❤️🙊"

ws[198] = "🚶"
rs[198] = "﴿ويۙـۧـﮩـﮯۙﻦ﴾ رايح نبض 🙁❤️🍃"

ws[199] = "🌚🎈"
rs[199] = "مدري ليش تعجبيني🙁✋🏿"

ws[200] = "🌝🚶"
rs[200] = "لو تمشي لو تبقة 🐸💔"

ws[201] = "واتس"
rs[201] = "اكتب يم اسمك ساحف 🐸💔"

ws[202] = "🌝🌝"
rs[202] = "عود ثكال 🐸💔"

ws[203] = "خيو"
rs[203] = "لَاَ تَكَولَيَ عَنَيَ خَيَيَ واَنَيَ شَيَبَ طَيَزَّيَ مَنَهَنَ مَولَجَلَ خَيَيَ وخَويَهَ اَنَهَ مَاَ اَسَتَنَكَفَ مَنَهَنَ اَلَسَواَلَفَ ذنَيَ عَيَبَ كَدَاَمَ اَلَرَبَعَ واَلَصَحَبَهَ يَعَنَيَ تَقَبَلَيَنَ يَكَولَونَ شيخ اَخَ كَحَبَه 🌝✋🏿"

ws[204] = "احمد"
rs[204] = "كله بالفراش امدد"

ws[205] = "حسن"
rs[205] = "24 ساعة يشرب لبن😹"

ws[206] = "شبح"
rs[206] = "شبح لو ظهر😹💔"

ws[207] = "هاني"
rs[207] = "هاني واخوتي واهلي كلهم😹✋🏿"

ws[208] = "سامر"
rs[208] = "سامر روحه من السطح😹✋🏿"

ws[209] = "شعبان"
rs[209] = "شعبان وبعد مااكدر😹😹"

ws[210] = "نوح"
rs[210] = "نوح وتعال😹✋🏿"

ws[211] = "شكر"
rs[211] = "شكر وعربده واعتداء على المواطنين🙁💔"

ws[212] = "تعال"
rs[212] = "تعال ابو الاصبع"

ws[213] = "اثير"
rs[213] = "أثير بحرب إيران😹✋🏿"

ws[214] = "اه"
rs[214] = "ادري بيه يوجع تحمل 😹✋🏿"

ws[215] = "آه"
rs[215] = "ادري بيه يوجع تحمل 😹✋🏿"

ws[216] = "عيد الحب"
rs[216] = "هذي الليله عيد الكفار واذا بنحدق انهز الزار بنكضيهأإ شرب بالبأر نضرب اوزو بصحت الكٌحبه😹💔"

-- the main function
function run( msg, matches )
-- just a local variables that i used in my algorithm 
local i = 0; local w = false

-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
for k,v in pairs(ws) do
-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
-- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
i = k; w = true;
end
end

-- check if { w } is not false and { i } not equals to 0
if ( (w ~= false) and (i ~= 0) ) then
-- get the receiver :3 
R = get_receiver(msg)
-- send him the proper message from the index that { i } assigned to
--send_large_msg ( R , rs[i] );
--send_reply(msg.id, rs[i])
reply_msg(msg.id, rs[i], ok_cb, false )
end

-- don't edit this section
if ( msg.text == "about" ) then
if ( msg.from.username == "Mouamle" ) then
R = get_receiver(msg)
send_large_msg ( R , "Made by @Mouamle" );
end
end 

end



return {
patterns = {
"(.*)"	
},
run = run
} 


end